In [3]:
# Selecting rows and columns
import pandas as pd
df=pd.read_excel("data.xlsx")

In [4]:
df

      Name School  Marks
0  Shubham    SPS     56
1   Joshua   UPES     77
2     Jack    LPU     45
3     Alex    RIT     67
4    Rishi    NIT     78
5    Akash    RTS     90

In [5]:
df["Name"][0]

'Shubham'

In [7]:
df.loc[3]   # row at index 3

Name      Alex
School     RIT
Marks       67
Name: 3, dtype: object

In [8]:
df.iloc[3]

Name      Alex
School     RIT
Marks       67
Name: 3, dtype: object

In [10]:
df.loc[0, "Name"]        # Value at row 0, column 'Name'

'Shubham'

In [11]:
df.iloc[0, 1]            # Value at row 0, column at index 1

'SPS'

In [13]:


df.loc[0:2, ["Name", "Marks"]]   # Rows 0 to 2, selected columns

      Name  Marks
0  Shubham     56
1   Joshua     77
2     Jack     45

In [14]:
df.iloc[0:2, 0:2]

      Name School
0  Shubham    SPS
1   Joshua   UPES

In [15]:
df.at[0, "Name"]       # Fast label-based access
df.iat[0, 1]           # Fast position-based access

'SPS'

In [17]:
df[df["Marks"] > 60]

     Name School  Marks
1  Joshua   UPES     77
3    Alex    RIT     67
4   Rishi    NIT     78
5   Akash    RTS     90

In [19]:
df[(df["Marks"] > 25) & (df["School"] == "UPES")]

     Name School  Marks
1  Joshua   UPES     77

In [20]:
df[(df["Name"] == "Joshua") | (df["Marks"] < 60)]

      Name School  Marks
0  Shubham    SPS     56
1   Joshua   UPES     77
2     Jack    LPU     45

In [21]:
#The .query() method in pandas lets you filter DataFrame rows using a string expression â€” it's a more readable and often more concise alternative to using boolean indexing.

In [25]:
df.query("Marks > 85 and Name == 'Akash'")

    Name School  Marks
5  Akash    RTS     90